Is there any way to change the way it works in such setup? I hardcoded VNET id just for test and now all of the suden I have a cycle coming from different modules, which doesn't make that much sense to me since there are no direct dependencies between them. Honestly I'm just looking for the best balance between modular setup and dynamic provisioning of infra.

Any tips for resolving the issue locally?

Now only permissions and private endpoint is replaced, others are replaced in place:

```
  # module.databricks_setup.module.create_databricks_workspace_managed.azurerm_private_endpoint.private_endpoint_databricks_dbw must be replaced
-/+ resource "azurerm_private_endpoint" "private_endpoint_databricks_dbw" {
      ~ custom_dns_configs            = [
          - {
              - fqdn         = ""
              - ip_addresses = [
                  - "",
                ]
            },
        ] -> (known after apply)
      ~ id                            = "" -> (known after apply)
        name                          = ""
      ~ network_interface             = [
          - {
              - id   = ""
              - name = ""
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [] -> (known after apply)
      ~ subnet_id                     = "" -> (known after apply) # forces replacement
      ~ tags                          = {
            "managed_by"   = "Terraform"
            "test"         = "testtag"
          + "test2"        = "tag"
        }
        # (3 unchanged attributes hidden)

      ~ private_service_connection {
            name                              = ""
          ~ private_ip_address                = "" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

[...]
  # module.databricks_setup.module.workspace_admins.databricks_permission_assignment.databricks_admin must be replaced
-/+ resource "databricks_permission_assignment" "databricks_admin" {
      ~ id           = "" -> (known after apply)
      ~ principal_id = "" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.databricks_setup.module.create_databricks_workspace_managed.azurerm_databricks_workspace.dbw will be updated in-place
  ~ resource "azurerm_databricks_workspace" "dbw" {
        id                                                  = ""
        name                                                = ""
      ~ tags                                                = {
            "managed_by"   = "Terraform"
            "test"         = "testtag"
          + "test2"        = "tag"
        }
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

[...]

Plan: 2 to add, 13 to change, 2 to destroy.
╷
│ Error: Cycle: module.databricks_setup.module.create_databricks_environment.azurerm_private_dns_a_record.dns_record_dev_bc (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_dns_a_record.dns_record_prod_vc (expand), module.databricks_setup.module.create_databricks_environment.output.kv_private_endpoint_name (expand), module.databricks_setup.module.create_databricks_environment.output.storage_account_name (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_dns_a_record.dns_record_dev_vc (expand), module.databricks_setup.module.create_databricks_environment.output.key_vault_id (expand), module.databricks_setup.module.create_databricks_environment.output.kv_private_endpoint_ip_address (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_endpoint.private_endpoint_vc, module.databricks_setup.module.create_databricks_environment.azurerm_role_assignment.azroleas (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_endpoint.private_endpoint_vc (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_dns_a_record.dns_record_prod_dfs (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_dns_a_record.dns_record_prod_bc (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_endpoint.private_endpoint_bc, module.databricks_setup.module.create_databricks_environment.azurerm_private_endpoint.private_endpoint_bc (expand), module.databricks_setup.module.create_databricks_environment.output.access_connector_name (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_endpoint.private_endpoint_dfs (expand), module.databricks_setup.module.create_databricks_environment.azurerm_private_endpoint.private_endpoint_dfs, module.databricks_setup.module.create_databricks_environment.azurerm_private_dns_a_record.dns_record_dev_dfs (expand), module.databricks_setup.module.create_databricks_environment.output.key_vault_name (expand), module.databricks_setup.module.create_databricks_environment.output.storage_account_rg (expand), module.databricks_setup.module.create_databricks_environment (close), module.databricks_setup.module.create_databricks_environment.azurerm_databricks_access_connector.access_connector, module.databricks_setup.module.create_databricks_environment.azurerm_databricks_access_connector.access_connector (expand), module.databricks_setup.module.create_databricks_environment.output.access_connector_id (expand), module.databricks_setup.module.create_databricks_environment.azurerm_storage_account.storage_account, module.databricks_setup.module.create_databricks_environment.azurerm_storage_account.storage_account (expand), module.databricks_setup.module.create_databricks_environment.output.storage_account_id (expand), module.databricks_setup.module.create_databricks_workspace_managed.azurerm_databricks_workspace.dbw (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.output.private_subnet (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking (close), module.databricks_setup.module.create_databricks_workspace_managed.var.private_subnet_address_prefix (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.private_subnet_address_prefix (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.private_subnet_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.azurerm_subnet.private_subnet (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.azurerm_subnet_network_security_group_association.private_subnet_association (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.output.private_association_id (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.output.network_security_group_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.output.network_security_group_id (expand), module.databricks_setup.module.create_databricks_workspace_managed.var.tags (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.tags (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.nsg_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.location (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.azurerm_network_security_group.databricks_network_security_group (expand), module.databricks_setup.module.create_databricks_environment.output.dbw_resource_group_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.var.dbw_resource_group_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.nsg_resource_group_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.azurerm_network_security_group.databricks_network_security_group, module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.azurerm_subnet_network_security_group_association.public_subnet_association (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.output.public_association_id (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.delegation_actions (expand), module.databricks_setup.module.create_databricks_workspace_managed.var.public_subnet_address_prefix (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.public_subnet_address_prefix (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.virtual_network (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.service_endpoints (expand), module.databricks_setup.module.create_databricks_workspace_managed.var.environment (expand), module.databricks_setup.module.create_databricks_workspace_managed.var.workspace (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.public_subnet_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.service_delegation_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.delegation_name (expand), module.databricks_setup.module.create_databricks_workspace_managed.var.subscription (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.var.virtual_network_resource_group (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.azurerm_subnet.public_subnet (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking (expand), module.databricks_setup.module.create_databricks_workspace_managed.module.databricks_networking.output.public_subnet (expand), module.databricks_setup.module.create_databricks_workspace_managed.azurerm_databricks_workspace.dbw, module.databricks_setup.module.create_databricks_workspace_managed.output.databricks_workspace_url (expand), module.databricks_setup.output.databricks_workspace_url (expand), local.host (expand), provider["registry.terraform.io/databricks/databricks"].workspace, module.databricks_setup.module.workspace_admins.databricks_permission_assignment.databricks_admin (destroy), module.databricks_setup.module.create_databricks_workspace_managed.azurerm_private_endpoint.private_endpoint_databricks_dbw (destroy), module.databricks_setup.module.create_databricks_environment.azurerm_resource_group.rg, module.databricks_setup.module.create_databricks_environment.azurerm_key_vault.key_vault (expand), module.databricks_setup.module.create_databricks_environment.output.key_vault_uri (expand), module.databricks_setup.module.create_databricks_workspace_managed (expand)
│ 
```
